app/controllers/comments_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("link_id", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["link_id", 1], ["body", "dsdsd"], ["user_id", 1], ["created_at", "2019-01-24 14:07:30.994476"], ["updated_at", "2019-01-24 14:07:30.994476"]]
---
  def create
    @link = Link.find(params[:link_id])
    @comment = @link.comments.new(comment_params)
    @comment.user = current_user



    respond_to do |format|
      if @comment.save