app/controllers/links_controller.rb

  def show
    @link = Link.find(params[:id])
    @linkk = "google.com"
    @comment=Comment.all
    @user = User.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "asd"], ["url", "dsd"], ["created_at", "2019-01-24 13:29:49.860381"], ["updated_at", "2019-01-24 13:29:49.860381"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @link.update(link_params)
---
UPDATE "links" SET "url" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["url", "google.com"], ["updated_at", "2019-01-21 07:32:33.894221"], ["id", 2]]